In [1]:
# what is pandas merge function?
# pandas merge connects columns or indexes in dataframe based on one or more keys.
# means by using pandas merge function we can merge multiple dataframes by column or indexes based pn one or more keys.
# merge as the entry point for all standard database join operation between dataframe objects.
# means it is the entry point of dataframe .

In [2]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({"ID":[1,2,3,4],"Name":["A","B","C","D"]})
df1

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [9]:
df2 = pd.DataFrame({"ID":[1,2,3,5],"Class":[9,10,11,12]})
df2

   ID  Class
0   1      9
1   2     10
2   3     11
3   5     12

In [12]:
pd.merge(df2,df1,on="ID")# present same index as a key:

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [10]:
pd.merge(df1,df2)

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11

In [11]:
pd.merge(df1,df2)

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11

In [13]:
pd.merge(df2,df1,on="ID",how="inner") # how takes default value inner

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [14]:
pd.merge(df2,df1,on="ID",how="left")

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   5     12  NaN

In [15]:
pd.merge(df2,df1,on="ID",how="right")

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   4    NaN    D

In [16]:
pd.merge(df2,df1,on="ID",how="outer")

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   5   12.0  NaN
4   4    NaN    D

In [17]:
pd.merge(df2,df1,on="ID",how="outer",indicator=True) # indicator takes default value False

   ID  Class Name      _merge
0   1    9.0    A        both
1   2   10.0    B        both
2   3   11.0    C        both
3   5   12.0  NaN   left_only
4   4    NaN    D  right_only

In [18]:
df1

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [19]:
df2

   ID  Class
0   1      9
1   2     10
2   3     11
3   5     12

In [20]:
df2 = pd.DataFrame({"ID":[5,6,7,8],"Class":[9,10,11,12]})
df2

   ID  Class
0   5      9
1   6     10
2   7     11
3   8     12

In [22]:
pd.merge(df1,df2,left_index = True , right_index = True)# if we have multi index and different values then to show these values we use this

   ID_x Name  ID_y  Class
0     1    A     5      9
1     2    B     6     10
2     3    C     7     11
3     4    D     8     12

In [24]:
pd.merge(df1,df2)# so in this situation we have to use above parameters :

Empty DataFrame
Columns: [ID, Name, Class]
Index: []

In [25]:
df1 = pd.DataFrame({"ID":[1,2,3,4],"Name":["A","B","C","D"]})
df1

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [26]:
df1 = pd.DataFrame({"ID":[1,2,3,5],"Class":[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   5     12

In [28]:
pd.merge(df1,df2,on="ID",indicator=True)# here surffix parameter works:

   ID  Class_x  Class_y _merge
0   5       12        9   both

In [29]:
pd.merge(df1,df2,on="ID",indicator=True , suffixes = ("_Higher ","_Lower"))

   ID  Class_Higher   Class_Lower _merge
0   5             12            9   both